---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightGroupManager.GetGroups
source: html/677017f7-5e44-3578-7ffe-184cc8d99d31.htm
---
# Autodesk.Revit.DB.Lighting.LightGroupManager.GetGroups Method

Get the set of contained LightGroup objects
 The set of LightGroup objects

## Syntax (C#)
```csharp
public IList<LightGroup> GetGroups()
```